In [1]:
import pandas as pd

In [2]:
import pandas as pd
import numpy as np

# Dataset 1: Employee Data
employees = pd.DataFrame({
    'EmployeeID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Name': ['John', 'Sarah', 'Mike', 'Emma', 'David', 'Lisa', 'Tom', 'Anna', 'James', 'Sophie'],
    'Department': ['Sales', 'IT', 'HR', 'Sales', 'IT', 'HR', 'Sales', 'IT', 'Finance', 'Finance'],
    'Age': [28, 34, 45, 29, 38, 42, 31, 27, 50, 36],
    'Salary': [50000, 75000, 65000, 52000, 80000, 68000, 55000, 72000, 90000, 85000],
    'YearsExperience': [3, 8, 15, 4, 10, 12, 5, 6, 20, 14],
    'City': ['New York', 'Boston', 'Chicago', 'New York', 'Boston', 'Chicago', 'New York', 'Boston', 'Chicago', 'New York']
})

print("Employees DataFrame:")
print(employees)

Employees DataFrame:
   EmployeeID    Name Department  Age  Salary  YearsExperience      City
0         101    John      Sales   28   50000                3  New York
1         102   Sarah         IT   34   75000                8    Boston
2         103    Mike         HR   45   65000               15   Chicago
3         104    Emma      Sales   29   52000                4  New York
4         105   David         IT   38   80000               10    Boston
5         106    Lisa         HR   42   68000               12   Chicago
6         107     Tom      Sales   31   55000                5  New York
7         108    Anna         IT   27   72000                6    Boston
8         109   James    Finance   50   90000               20   Chicago
9         110  Sophie    Finance   36   85000               14  New York

In [3]:
# Dataset 2: Sales Data
sales = pd.DataFrame({
    'OrderID': ['A001', 'A002', 'A003', 'A004', 'A005', 'A006', 'A007', 'A008'],
    'Product': ['Laptop', 'Mouse', 'Keyboard', 'Monitor', 'Laptop', 'Mouse', 'Keyboard', 'Monitor'],
    'Quantity': [2, 5, 3, 1, 1, 10, 4, 2],
    'Price': [1200, 25, 75, 300, 1200, 25, 75, 300],
    'Region': ['East', 'West', 'East', 'North', 'West', 'East', 'North', 'South'],
    'SalesRep': ['John', 'Sarah', 'John', 'Mike', 'Emma', 'Sarah', 'Mike', 'Emma']
})

print("\nSales DataFrame:")
print(sales)

Sales DataFrame:
  OrderID   Product  Quantity  Price Region SalesRep
0    A001    Laptop         2   1200   East     John
1    A002     Mouse         5     25   West    Sarah
2    A003  Keyboard         3     75   East     John
3    A004   Monitor         1    300  North     Mike
4    A005    Laptop         1   1200   West     Emma
5    A006     Mouse        10     25   East    Sarah
6    A007  Keyboard         4     75  North     Mike
7    A008   Monitor         2    300  South     Emma

In [4]:
##"""Task: Extract the following from the employees DataFrame:
##The 'Name' column as a Series

names = employees['Name']
print(names)

0      John
1     Sarah
2      Mike
3      Emma
4     David
5      Lisa
6       Tom
7      Anna
8     James
9    Sophie
Name: Name, dtype: object

In [5]:
dept = [employees['Department']]
print(dept)

[0      Sales
1         IT
2         HR
3      Sales
4         IT
5         HR
6      Sales
7         IT
8    Finance
9    Finance
Name: Department, dtype: object]

In [6]:
info = employees[['Age', 'Salary', 'YearsExperience']]
print(info)

   Age  Salary  YearsExperience
0   28   50000                3
1   34   75000                8
2   45   65000               15
3   29   52000                4
4   38   80000               10
5   42   68000               12
6   31   55000                5
7   27   72000                6
8   50   90000               20
9   36   85000               14

In [7]:
Ages = employees.Age
print(Ages)

0    28
1    34
2    45
3    29
4    38
5    42
6    31
7    27
8    50
9    36
Name: Age, dtype: int64

In [8]:
Age = employees[['Age']]
print(Age)
print(type('Age'))

   Age
0   28
1   34
2   45
3   29
4   38
5   42
6   31
7   27
8   50
9   36
<class 'str'>

In [9]:
employees.shape

(10, 7)

In [10]:
employees.value_counts(['Department'])

Department
Sales         3
IT            3
HR            2
Finance       2
Name: count, dtype: int64

In [11]:
highest_dept = employees['Department'].value_counts(sort = True)
print(highest_dept)

Department
Sales      3
IT         3
HR         2
Finance    2
Name: count, dtype: int64

In [12]:
highest_dept = employees['Department'].value_counts().max
print(highest_dept)

<bound method Series.max of Department
Sales      3
IT         3
HR         2
Finance    2
Name: count, dtype: int64>

In [13]:
Propotion_percentages = employees.value_counts(normalize=True)
print(Propotion_percentages)

EmployeeID  Name    Department  Age  Salary  YearsExperience  City
101         John    Sales       28   50000   3                New York    0.1
102         Sarah   IT          34   75000   8                Boston      0.1
103         Mike    HR          45   65000   15               Chicago     0.1
104         Emma    Sales       29   52000   4                New York    0.1
105         David   IT          38   80000   10               Boston      0.1
106         Lisa    HR          42   68000   12               Chicago     0.1
107         Tom     Sales       31   55000   5                New York    0.1
108         Anna    IT          27   72000   6                Boston      0.1
109         James   Finance     50   90000   20               Chicago     0.1
110         Sophie  Finance     36   85000   14               New York    0.1
Name: proportion, dtype: float64

In [14]:
city_count = employees['City'].value_counts(ascending=True)
print(city_count)

City
Boston      3
Chicago     3
New York    4
Name: count, dtype: int64

In [15]:
employees.head(1)

   EmployeeID  Name Department  Age  Salary  YearsExperience      City
0         101  John      Sales   28   50000                3  New York

In [16]:
first_row = employees.iloc[0]
print(first_row)

EmployeeID              101
Name                   John
Department            Sales
Age                      28
Salary                50000
YearsExperience           3
City               New York
Name: 0, dtype: object

In [17]:
last_row = employees.iloc[-1]
print(last_row)

EmployeeID              110
Name                 Sophie
Department          Finance
Age                      36
Salary                85000
YearsExperience          14
City               New York
Name: 9, dtype: object

In [18]:
specific_pos = employees.iloc[[2, 4, 6]]
print(specific_pos)

   EmployeeID   Name Department  Age  Salary  YearsExperience      City
2         103   Mike         HR   45   65000               15   Chicago
4         105  David         IT   38   80000               10    Boston
6         107    Tom      Sales   31   55000                5  New York

In [19]:
employees.head(6)

   EmployeeID   Name Department  Age  Salary  YearsExperience      City
0         101   John      Sales   28   50000                3  New York
1         102  Sarah         IT   34   75000                8    Boston
2         103   Mike         HR   45   65000               15   Chicago
3         104   Emma      Sales   29   52000                4  New York
4         105  David         IT   38   80000               10    Boston
5         106   Lisa         HR   42   68000               12   Chicago

In [20]:
employees.iloc[3:7]

   EmployeeID   Name Department  Age  Salary  YearsExperience      City
3         104   Emma      Sales   29   52000                4  New York
4         105  David         IT   38   80000               10    Boston
5         106   Lisa         HR   42   68000               12   Chicago
6         107    Tom      Sales   31   55000                5  New York

In [21]:
result = employees.iloc[::2]
print(result)

   EmployeeID   Name Department  Age  Salary  YearsExperience      City
0         101   John      Sales   28   50000                3  New York
2         103   Mike         HR   45   65000               15   Chicago
4         105  David         IT   38   80000               10    Boston
6         107    Tom      Sales   31   55000                5  New York
8         109  James    Finance   50   90000               20   Chicago

In [22]:
employees.iloc[::-1]

   EmployeeID    Name Department  Age  Salary  YearsExperience      City
9         110  Sophie    Finance   36   85000               14  New York
8         109   James    Finance   50   90000               20   Chicago
7         108    Anna         IT   27   72000                6    Boston
6         107     Tom      Sales   31   55000                5  New York
5         106    Lisa         HR   42   68000               12   Chicago
4         105   David         IT   38   80000               10    Boston
3         104    Emma      Sales   29   52000                4  New York
2         103    Mike         HR   45   65000               15   Chicago
1         102   Sarah         IT   34   75000                8    Boston
0         101    John      Sales   28   50000                3  New York

In [23]:
employee_5 = employees.loc[5]
print(employee_5)

EmployeeID             106
Name                  Lisa
Department              HR
Age                     42
Salary               68000
YearsExperience         12
City               Chicago
Name: 5, dtype: object

In [24]:
employees.loc[[2,5,8]]

   EmployeeID   Name Department  Age  Salary  YearsExperience     City
2         103   Mike         HR   45   65000               15  Chicago
5         106   Lisa         HR   42   68000               12  Chicago
8         109  James    Finance   50   90000               20  Chicago

In [25]:
info_loc = employees.loc[4, ['Name', 'Department']]
print(info_loc)

Name          David
Department       IT
Name: 4, dtype: object

In [26]:
info_spec = employees.loc[3:7, ['Name', 'Age', 'Salary']]
print(info_spec)

    Name  Age  Salary
3   Emma   29   52000
4  David   38   80000
5   Lisa   42   68000
6    Tom   31   55000
7   Anna   27   72000

In [27]:
third_row = employees.iloc[3]
print(third_row)

EmployeeID              104
Name                   Emma
Department            Sales
Age                      29
Salary                52000
YearsExperience           4
City               New York
Name: 3, dtype: object

In [28]:
exc = employees.iloc[2:5]
print(exc)

   EmployeeID   Name Department  Age  Salary  YearsExperience      City
2         103   Mike         HR   45   65000               15   Chicago
3         104   Emma      Sales   29   52000                4  New York
4         105  David         IT   38   80000               10    Boston

In [29]:
employees.iloc[:4, :3]

   EmployeeID   Name Department
0         101   John      Sales
1         102  Sarah         IT
2         103   Mike         HR
3         104   Emma      Sales

In [30]:
employees.iloc[:, [1,3,5]]

     Name  Age  YearsExperience
0    John   28                3
1   Sarah   34                8
2    Mike   45               15
3    Emma   29                4
4   David   38               10
5    Lisa   42               12
6     Tom   31                5
7    Anna   27                6
8   James   50               20
9  Sophie   36               14

In [31]:
older_emp = employees.loc[employees['Age'] == 35]
print(older_emp)

Empty DataFrame
Columns: [EmployeeID, Name, Department, Age, Salary, YearsExperience, City]
Index: []

In [32]:
IT_emp = employees.loc[employees['Department'] == 'IT']
print(IT_emp)

   EmployeeID   Name Department  Age  Salary  YearsExperience    City
1         102  Sarah         IT   34   75000                8  Boston
4         105  David         IT   38   80000               10  Boston
7         108   Anna         IT   27   72000                6  Boston

In [33]:
high_sal = employees.loc[employees['Salary'] >70000]
print(high_sal)

   EmployeeID    Name Department  Age  Salary  YearsExperience      City
1         102   Sarah         IT   34   75000                8    Boston
4         105   David         IT   38   80000               10    Boston
7         108    Anna         IT   27   72000                6    Boston
8         109   James    Finance   50   90000               20   Chicago
9         110  Sophie    Finance   36   85000               14  New York

In [34]:
NewYork_Emp = employees.loc[employees['City'] == 'New York']
print(NewYork_Emp)

   EmployeeID    Name Department  Age  Salary  YearsExperience      City
0         101    John      Sales   28   50000                3  New York
3         104    Emma      Sales   29   52000                4  New York
6         107     Tom      Sales   31   55000                5  New York
9         110  Sophie    Finance   36   85000               14  New York

In [35]:
Age_Sal = employees.loc[(employees['Age'] > 30) & (employees['Salary'] > 60000)]
print(Age_Sal)

   EmployeeID    Name Department  Age  Salary  YearsExperience      City
1         102   Sarah         IT   34   75000                8    Boston
2         103    Mike         HR   45   65000               15   Chicago
4         105   David         IT   38   80000               10    Boston
5         106    Lisa         HR   42   68000               12   Chicago
8         109   James    Finance   50   90000               20   Chicago
9         110  Sophie    Finance   36   85000               14  New York

In [36]:
result = employees.loc[(employees['Age'] < 30) | (employees['Age'] > 45)]
print(result)

   EmployeeID   Name Department  Age  Salary  YearsExperience      City
0         101   John      Sales   28   50000                3  New York
3         104   Emma      Sales   29   52000                4  New York
7         108   Anna         IT   27   72000                6    Boston
8         109  James    Finance   50   90000               20   Chicago

In [37]:
result2 = employees.loc[employees['Department'].isin(['Sales', 'HR'])]
print(result2)

   EmployeeID  Name Department  Age  Salary  YearsExperience      City
0         101  John      Sales   28   50000                3  New York
2         103  Mike         HR   45   65000               15   Chicago
3         104  Emma      Sales   29   52000                4  New York
5         106  Lisa         HR   42   68000               12   Chicago
6         107   Tom      Sales   31   55000                5  New York

In [38]:
info2 = employees.loc[employees['Salary'] > 70000, ['Name', 'Salary']]
print(info2)

     Name  Salary
1   Sarah   75000
4   David   80000
7    Anna   72000
8   James   90000
9  Sophie   85000

In [39]:
info3 = employees.loc[employees['Department'] == 'Finance', ['Name', 'Age', 'City']]
print(info3)

     Name  Age      City
8   James   50   Chicago
9  Sophie   36  New York

In [40]:
info4 = employees[employees['Age'] > 40].drop('EmployeeID', axis=1)
print(info4)

    Name Department  Age  Salary  YearsExperience     City
2   Mike         HR   45   65000               15  Chicago
5   Lisa         HR   42   68000               12  Chicago
8  James    Finance   50   90000               20  Chicago

In [41]:
youngest_idx = employees['Age'].idxmin()
result = employees.loc[youngest_idx, ['Department', 'YearsExperience']]
print(result)

Department         IT
YearsExperience     6
Name: 7, dtype: object

In [42]:
## seting index
Name_indexed = employees.set_index('Name')
print(Name_indexed)

        EmployeeID Department  Age  Salary  YearsExperience      City
Name
John           101      Sales   28   50000                3  New York
Sarah          102         IT   34   75000                8    Boston
Mike           103         HR   45   65000               15   Chicago
Emma           104      Sales   29   52000                4  New York
David          105         IT   38   80000               10    Boston
Lisa           106         HR   42   68000               12   Chicago
Tom            107      Sales   31   55000                5  New York
Anna           108         IT   27   72000                6    Boston
James          109    Finance   50   90000               20   Chicago
Sophie         110    Finance   36   85000               14  New York

In [43]:
print(Name_indexed.loc['Sarah'])

EmployeeID            102
Department             IT
Age                    34
Salary              75000
YearsExperience         8
City               Boston
Name: Sarah, dtype: object

In [44]:
## Get information for John, Mike, and Lisa (using the name index)
print(Name_indexed.loc[['John', 'Mike', 'Lisa']])

      EmployeeID Department  Age  Salary  YearsExperience      City
Name
John         101      Sales   28   50000                3  New York
Mike         103         HR   45   65000               15   Chicago
Lisa         106         HR   42   68000               12   Chicago

In [45]:
## Get the 'Salary' and 'Department' for employees from 'Emma' to 'Tom' (inclusive)
print(employees.set_index('Name').loc['Emma':'Tom', ['Salary', 'Department']])

       Salary Department
Name
Emma    52000      Sales
David   80000         IT
Lisa    68000         HR
Tom     55000      Sales

In [46]:
## reset index
reset= Name_indexed.reset_index()
print(reset)

     Name  EmployeeID Department  Age  Salary  YearsExperience      City
0    John         101      Sales   28   50000                3  New York
1   Sarah         102         IT   34   75000                8    Boston
2    Mike         103         HR   45   65000               15   Chicago
3    Emma         104      Sales   29   52000                4  New York
4   David         105         IT   38   80000               10    Boston
5    Lisa         106         HR   42   68000               12   Chicago
6     Tom         107      Sales   31   55000                5  New York
7    Anna         108         IT   27   72000                6    Boston
8   James         109    Finance   50   90000               20   Chicago
9  Sophie         110    Finance   36   85000               14  New York

In [47]:
## row 2-6 and in Name and Salary columns Exclusive
print(employees.loc[2:6, 'Name':'Salary'])

    Name Department  Age  Salary
2   Mike         HR   45   65000
3   Emma      Sales   29   52000
4  David         IT   38   80000
5   Lisa         HR   42   68000
6    Tom      Sales   31   55000

In [48]:
## All rows in Age and YearsExperience
print(employees.loc[:, 'Age':'YearsExperience'])

   Age  Salary  YearsExperience
0   28   50000                3
1   34   75000                8
2   45   65000               15
3   29   52000                4
4   38   80000               10
5   42   68000               12
6   31   55000                5
7   27   72000                6
8   50   90000               20
9   36   85000               14

In [49]:
## row 1,3,5,7 and Name, Department, City
print(employees.loc[[1, 3, 5, 7], ['Name', 'Department', 'City']])

    Name Department      City
1  Sarah         IT    Boston
3   Emma      Sales  New York
5   Lisa         HR   Chicago
7   Anna         IT    Boston

In [50]:
## last 4 rows and last 4 columns
print(employees.loc[employees.index[-4:], employees.columns[:4]])

   EmployeeID    Name Department  Age
6         107     Tom      Sales   31
7         108    Anna         IT   27
8         109   James    Finance   50
9         110  Sophie    Finance   36

In [51]:
## rows from 1-8 and all columns
print(employees.iloc[1:8, :])

   EmployeeID   Name Department  Age  Salary  YearsExperience      City
1         102  Sarah         IT   34   75000                8    Boston
2         103   Mike         HR   45   65000               15   Chicago
3         104   Emma      Sales   29   52000                4  New York
4         105  David         IT   38   80000               10    Boston
5         106   Lisa         HR   42   68000               12   Chicago
6         107    Tom      Sales   31   55000                5  New York
7         108   Anna         IT   27   72000                6    Boston

In [52]:
## last 5 rows and last 3 columns
print(employees.loc[employees.index[-5:], employees.columns[-3:]])

   Salary  YearsExperience      City
5   68000               12   Chicago
6   55000                5  New York
7   72000                6    Boston
8   90000               20   Chicago
9   85000               14  New York

In [53]:
## Get rows at positions [0, 2, 4, 6, 8] and columns at positions [1, 3, 5]
print(employees.iloc[[0, 2, 4, 6, 8], [1, 3, 5]])

    Name  Age  YearsExperience
0   John   28                3
2   Mike   45               15
4  David   38               10
6    Tom   31                5
8  James   50               20

In [54]:
##Get the middle 6 rows and middle 4 columns
print(employees.loc[employees.index[:+6], employees.columns[:+4]])

   EmployeeID   Name Department  Age
0         101   John      Sales   28
1         102  Sarah         IT   34
2         103   Mike         HR   45
3         104   Emma      Sales   29
4         105  David         IT   38
5         106   Lisa         HR   42

In [55]:
## Which product was sold most frequently? 

print(sales['Product'].value_counts())

Product
Laptop      2
Mouse       2
Keyboard    2
Monitor     2
Name: count, dtype: int64

In [56]:
## Get all orders from the 'East' region with Quantity greater than 2
print(sales[(sales['Region'] == 'East') & (sales['Quantity'] > 2)])

  OrderID   Product  Quantity  Price Region SalesRep
2    A003  Keyboard         3     75   East     John
5    A006     Mouse        10     25   East    Sarah

In [57]:
##Get 'Product', 'Quantity', and 'Region' for orders handled by 'Sarah' or 'John'
print(sales[(sales['SalesRep'] == 'Sarah') | (sales['SalesRep'] == 'John')][['Product', 'Quantity', 'Region']])

    Product  Quantity Region
0    Laptop         2   East
1     Mouse         5   West
2  Keyboard         3   East
5     Mouse        10   East

In [58]:
##Conditioning

In [59]:
# Create a comprehensive dataset
Data = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Henry', 'Iris', 'Jack'],
    'Age': [25, 32, 45, 28, 35, 52, 29, 41, 38, 31],
    'Department': ['Sales', 'IT', 'HR', 'Sales', 'IT', 'HR', 'Sales', 'IT', 'Finance', 'Finance'],
    'Salary': [50000, 75000, 65000, 52000, 80000, 68000, 55000, 90000, 85000, 72000],
    'City': ['NYC', 'Boston', 'Chicago', 'NYC', 'Boston', 'Chicago', 'NYC', 'Boston', 'Chicago', 'NYC'],
    'Experience': [2, 8, 15, 3, 10, 20, 4, 12, 14, 6],
    'Performance': ['Good', 'Excellent', 'Average', 'Good', 'Excellent', 'Good', 'Average', 'Excellent', 'Good', 'Average']
})

print(Data)

      Name  Age Department  Salary     City  Experience Performance
0    Alice   25      Sales   50000      NYC           2        Good
1      Bob   32         IT   75000   Boston           8   Excellent
2  Charlie   45         HR   65000  Chicago          15     Average
3    David   28      Sales   52000      NYC           3        Good
4      Eve   35         IT   80000   Boston          10   Excellent
5    Frank   52         HR   68000  Chicago          20        Good
6    Grace   29      Sales   55000      NYC           4     Average
7    Henry   41         IT   90000   Boston          12   Excellent
8     Iris   38    Finance   85000  Chicago          14        Good
9     Jack   31    Finance   72000      NYC           6     Average

In [60]:
names_with_a = Data[Data['Name'].str.contains('a', case=False)]
print(names_with_a)

      Name  Age Department  Salary     City  Experience Performance
0    Alice   25      Sales   50000      NYC           2        Good
2  Charlie   45         HR   65000  Chicago          15     Average
3    David   28      Sales   52000      NYC           3        Good
5    Frank   52         HR   68000  Chicago          20        Good
6    Grace   29      Sales   55000      NYC           4     Average
9     Jack   31    Finance   72000      NYC           6     Average

In [61]:
names_start_with_a = Data[Data['Name'].str.startswith('A')]
print(names_start_with_a)

    Name  Age Department  Salary City  Experience Performance
0  Alice   25      Sales   50000  NYC           2        Good

In [62]:
mid_age = Data[Data['Age'].between(30, 40)]
print(mid_age)

   Name  Age Department  Salary     City  Experience Performance
1   Bob   32         IT   75000   Boston           8   Excellent
4   Eve   35         IT   80000   Boston          10   Excellent
8  Iris   38    Finance   85000  Chicago          14        Good
9  Jack   31    Finance   72000      NYC           6     Average

In [63]:
Data.columns

Index(['Name', 'Age', 'Department', 'Salary', 'City', 'Experience',
       'Performance'],
      dtype='object')

In [64]:
Data.columns = [x.upper() for x in Data.columns]
Data

      NAME  AGE DEPARTMENT  SALARY     CITY  EXPERIENCE PERFORMANCE
0    Alice   25      Sales   50000      NYC           2        Good
1      Bob   32         IT   75000   Boston           8   Excellent
2  Charlie   45         HR   65000  Chicago          15     Average
3    David   28      Sales   52000      NYC           3        Good
4      Eve   35         IT   80000   Boston          10   Excellent
5    Frank   52         HR   68000  Chicago          20        Good
6    Grace   29      Sales   55000      NYC           4     Average
7    Henry   41         IT   90000   Boston          12   Excellent
8     Iris   38    Finance   85000  Chicago          14        Good
9     Jack   31    Finance   72000      NYC           6     Average

In [65]:
employees.columns = [x.upper() for x in employees.columns]
employees

   EMPLOYEEID    NAME DEPARTMENT  AGE  SALARY  YEARSEXPERIENCE      CITY
0         101    John      Sales   28   50000                3  New York
1         102   Sarah         IT   34   75000                8    Boston
2         103    Mike         HR   45   65000               15   Chicago
3         104    Emma      Sales   29   52000                4  New York
4         105   David         IT   38   80000               10    Boston
5         106    Lisa         HR   42   68000               12   Chicago
6         107     Tom      Sales   31   55000                5  New York
7         108    Anna         IT   27   72000                6    Boston
8         109   James    Finance   50   90000               20   Chicago
9         110  Sophie    Finance   36   85000               14  New York

In [66]:
employees.columns = employees.columns.str.replace(' ', '_')

In [67]:
employees

   EMPLOYEEID    NAME DEPARTMENT  AGE  SALARY  YEARSEXPERIENCE      CITY
0         101    John      Sales   28   50000                3  New York
1         102   Sarah         IT   34   75000                8    Boston
2         103    Mike         HR   45   65000               15   Chicago
3         104    Emma      Sales   29   52000                4  New York
4         105   David         IT   38   80000               10    Boston
5         106    Lisa         HR   42   68000               12   Chicago
6         107     Tom      Sales   31   55000                5  New York
7         108    Anna         IT   27   72000                6    Boston
8         109   James    Finance   50   90000               20   Chicago
9         110  Sophie    Finance   36   85000               14  New York

In [68]:
employees.rename(columns={'EMPLOYEEID':'EMPLOYEE_ID', 'YEARSEXPERIENCE':'YEARS_OF_EXPERIENCE'}, inplace = True)

In [69]:
employees

   EMPLOYEE_ID    NAME DEPARTMENT  AGE  SALARY  YEARS_OF_EXPERIENCE      CITY
0          101    John      Sales   28   50000                    3  New York
1          102   Sarah         IT   34   75000                    8    Boston
2          103    Mike         HR   45   65000                   15   Chicago
3          104    Emma      Sales   29   52000                    4  New York
4          105   David         IT   38   80000                   10    Boston
5          106    Lisa         HR   42   68000                   12   Chicago
6          107     Tom      Sales   31   55000                    5  New York
7          108    Anna         IT   27   72000                    6    Boston
8          109   James    Finance   50   90000                   20   Chicago
9          110  Sophie    Finance   36   85000                   14  New York

In [70]:
def add_tax(SALARY):
           return SALARY * 1.2

employees['SalaryWithTax'] = employees['SALARY'].apply(add_tax)
print(employees)

   EMPLOYEE_ID    NAME DEPARTMENT  AGE  SALARY  YEARS_OF_EXPERIENCE      CITY  \
0          101    John      Sales   28   50000                    3  New York
1          102   Sarah         IT   34   75000                    8    Boston
2          103    Mike         HR   45   65000                   15   Chicago
3          104    Emma      Sales   29   52000                    4  New York
4          105   David         IT   38   80000                   10    Boston
5          106    Lisa         HR   42   68000                   12   Chicago
6          107     Tom      Sales   31   55000                    5  New York
7          108    Anna         IT   27   72000                    6    Boston
8          109   James    Finance   50   90000                   20   Chicago
9          110  Sophie    Finance   36   85000                   14  New York

   SalaryWithTax
0        60000.0
1        90000.0
2        78000.0
3        62400.0
4        96000.0
5        81600.0
6        66000.0
7        86400.0
8       108000.0
9       102000.0

In [71]:
employees

,EMPLOYEE_ID,NAME,DEPARTMENT,AGE,SALARY,YEARS_OF_EXPERIENCE,CITY,SalaryWithTax
0,101,John,Sales,28,50000,3,New York,60000.0
1,102,Sarah,IT,34,75000,8,Boston,90000.0
2,103,Mike,HR,45,65000,15,Chicago,78000.0
3,104,Emma,Sales,29,52000,4,New York,62400.0
4,105,David,IT,38,80000,10,Boston,96000.0
5,106,Lisa,HR,42,68000,12,Chicago,81600.0
6,107,Tom,Sales,31,55000,5,New York,66000.0
7,108,Anna,IT,27,72000,6,Boston,86400.0
8,109,James,Finance,50,90000,20,Chicago,108000.0
9,110,Sophie,Finance,36,85000,14,New York,102000.0

In [72]:
pip install databricks-sql-connector

Requirement already satisfied: databricks-sql-connector in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (4.2.5)
Requirement already satisfied: lz4<5.0.0,>=4.0.2 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from databricks-sql-connector) (4.4.5)
Requirement already satisfied: oauthlib<4.0.0,>=3.1.0 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from databricks-sql-connector) (3.3.1)
Requirement already satisfied: openpyxl<4.0.0,>=3.0.10 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from databricks-sql-connector) (3.1.5)
Requirement already satisfied: pandas<2.4.0,>=1.2.5 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from databricks-sql-connector) (2.3.3)
Requirement already satisfied: pybreaker<2.0.0,>=1.0.0 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from databricks-sql-connector) (1.4.1)
Requirement already satisfied: pyjwt<3.0.0,>=2.0.0 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from databricks-sql-connector) (2.11.0)
Requirement already satisfied: python-dateutil<3.0.0,>=2.8.0 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from databricks-sql-connector) (2.9.0.post0)
Requirement already satisfied: requests<3.0.0,>=2.18.1 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from databricks-sql-connector) (2.32.5)
Requirement already satisfied: thrift<0.21.0,>=0.16.0 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from databricks-sql-connector) (0.20.0)
Requirement already satisfied: urllib3>=1.26 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from databricks-sql-connector) (2.6.2)
Requirement already satisfied: et-xmlfile in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from openpyxl<4.0.0,>=3.0.10->databricks-sql-connector) (2.0.0)
Requirement already satisfied: numpy>=1.23.2 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from pandas<2.4.0,>=1.2.5->databricks-sql-connector) (2.4.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from pandas<2.4.0,>=1.2.5->databricks-sql-connector) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from pandas<2.4.0,>=1.2.5->databricks-sql-connector) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil<3.0.0,>=2.8.0->databricks-sql-connector) (1.17.0)
Requirement already satisfied: charset_normalizer<4,>=2 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from requests<3.0.0,>=2.18.1->databricks-sql-connector) (3.4.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from requests<3.0.0,>=2.18.1->databricks-sql-connector) (3.11)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from requests<3.0.0,>=2.18.1->databricks-sql-connector) (2025.11.12)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.3 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [73]:
from dotenv import load_dotenv
import os

load_dotenv()

DATABRICKS_HOST  = os.getenv("DATABRICKS_HOST")
DATABRICKS_TOKEN = os.getenv("DATABRICKS_TOKEN")
HTTP_PATH        = os.getenv("DATABRICKS_HTTP_PATH")

# Verify they loaded
print("Host loaded:", DATABRICKS_HOST is not None)
print("Token loaded:", DATABRICKS_TOKEN is not None)
print("HTTP Path loaded:", HTTP_PATH is not None)

Host loaded: True
Token loaded: True
HTTP Path loaded: True

In [74]:
from databricks import sql

# Connect to Databricks
with sql.connect(
    server_hostname=DATABRICKS_HOST,
    http_path=HTTP_PATH,
    access_token=DATABRICKS_TOKEN
) as conn:
    cursor = conn.cursor()

    #  Load employees table 
    cursor.execute("""
        CREATE TABLE IF NOT EXISTS employees (
            EMPLOYEE_ID BIGINT,
            NAME STRING,
            DEPARTMENT STRING,
            AGE BIGINT,
            SALARY BIGINT,
            YEARS_OF_EXPERIENCE BIGINT,
            CITY STRING,
            SalaryWithTax DOUBLE
        )
    """)

    emp_rows = [tuple(row) for row in employees.itertuples(index=False, name=None)]
    cursor.executemany("INSERT INTO employees VALUES (?,?,?,?,?,?,?,?)", emp_rows)
    print(f" employees loaded  {len(emp_rows)} rows")

    #  Load sales table 
    cursor.execute("""
        CREATE TABLE IF NOT EXISTS sales (
            OrderID STRING,
            Product STRING,
            Quantity BIGINT,
            Price BIGINT,
            Region STRING,
            SalesRep STRING
        )
    """)

    sales_rows = [tuple(row) for row in sales.itertuples(index=False, name=None)]
    cursor.executemany("INSERT INTO sales VALUES (?,?,?,?,?,?)", sales_rows)
    print(f" sales loaded  {len(sales_rows)} rows")

    cursor.close()

print(" All done!")

[WARN] pyarrow is not installed by default since databricks-sql-connector 4.0.0,any arrow specific api (e.g. fetchmany_arrow) and cloud fetch will be disabled.If you need these features, please run pip install pyarrow or pip install databricks-sql-connector[pyarrow] to install

 employees loaded  10 rows
 sales loaded  8 rows
 All done!